Revit 2026 API

# PointOnCurveMeasureFrom Enumeration

---

Point on curve MeasureFrom - It tells from which end of the host curve the point location is measured.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum PointOnCurveMeasureFrom
```
```vb
Public Enumeration PointOnCurveMeasureFrom
```
```cpp
public enum class PointOnCurveMeasureFrom
```
```fsharp
type PointOnCurveMeasureFrom
```

| Member name | Value | Description |
| --- | --- | --- |
| Beginning | 1 | Beginning of the host curve. |
| End | 2 | End of the host curve. |

#### Reference

Autodesk.Revit.DB Namespace